;  搜狗五笔输入法--自定义短语配置文件

;  自定义短语说明：
;  1、自定义短语支持多行、空格、指定位置。
;  2、每条自定义短语最多支持300个汉字，总共支持100000条自定义短语。
;  3、自定义短语的格式如下：

;  单行的格式：
;  字符串+英文逗号+数字（指定排序位置）=短语

;  多行的格式：
;  字符串+英文逗号+数字（指定排序位置）=
;  多行短语

;  具体格式可以参考下面的实例。
;  自定义短语文件名为phrases.ini，存放在用户文件夹的根目录下。
;  4、最多支持100000行自定义短语。
;  5、自定义短语的用途有：快捷输入手机号、邮箱、诗词、小短文等，大家可以自由发挥。
;  6、时间函数功能。具体定义格式如下：
;  字符串+英文逗号+数字（指定排序位置）=#表达式
;  注意：表达式以英文#开头，后面的表达式中的每一个函数的前面都包含有英文$。
;  函数表如下：
;  函数    	含义    	举例
;  $year    	年(4位) 	2006、2008
;  $year_yy 年(2位) 	06、08
;  $month     	月      	12、8、3
;  $month_mm  	月      	12、08、03
;  $day     	日      	3、13、22
;  $day_dd  日         03、13、22
;  $weekday 	星期    	0、1、2、5、6
;  $fullhour    时(24小时制)  	02、08、13、23
;  $halfhour    时(12小时制)    02、08、01、11
;  $ampm    	AM、PM(英)  AM、PM（大写）
;  $minute  	分      	02、08、15、28
;  $second  	秒      	02、08、15、28
;  $year_cn 	年(中文4位) 二〇〇六
;  $year_yy_cn  年(中文2位) 〇六
;  $month_cn    月(中文)    十二、八、三
;  $day_cn  	日(中文)    三、十三、二十二
;  $weekday_cn 	星期(中文)  日、一、二、五、六
;  $fullhour_cn 时(中文24时制)  二、八、十三、二十三
;  $halfhour_cn 时(中文12时制)  二、八、一、十一
;  $ampm_cn 	上午下午(中文)  上午、下午
;  $minute_cn   分(中文)    零二、零八、十五、二十八
;  $second_cn   秒(中文)    零二、零八、十五、二十八

;  示例格式
;  ldwd,1=复活节
;  五笔编码,词序=自定义短语
;  请注意：自定义短语长度不能超过300个中英文字符，否则将被输入法自动截断

lol,1=[Lol]
fac,1=[Facepalm]
smi,1=[Smirk]
gri,1=[Grin]
hey,1=[Hey]
